# Домашнее задание

## Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [45]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [64]:
ratings[(ratings['rating'] == 5)].groupby('movieId').count().sort_values('rating', ascending=False).filter(items = ['movieId']).head(1)

Empty DataFrame
Columns: []
Index: [318]

In [77]:
ratings[['movieId', 'rating']].query('rating == 5').groupby('movieId').count().sort_values('rating', ascending=False).head(1)

         rating
movieId
318         153

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [79]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [91]:
filtered_countries = (power['country']=='Latvia') | (power['country']=='Lithuania')  | (power['country']=='Estonia')
filtered_category = (power['category']==4) | (power['category']==12) | (power['category']==21)
filtered_year = (power['year']>=2005) & (power['year']<=2010)
filtered_quantity = (power['quantity']>0)

In [97]:
power[(filtered_countries)&(filtered_category)&(filtered_year)&(filtered_quantity)].filter(items = ['quantity']).sum()

quantity    240580.0
dtype: float64

## Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [170]:
pd.read_html('https://fortrader.org/quotes')[3]

                                Type    Last   Chg.  Chg.%  Time
0               Яндекс Акции яндекса   43.18   0.00   0.00   NaN
1          Microsoft Microsoft Corp.  154.35   0.00   0.00   NaN
2                  APPLE Акции APPLE  274.61   0.00   0.00   NaN
3                Toyota Акции Тойоты  120.94   0.00   0.00   NaN
4   Volkswagen Курс акций Volkswagen  180.51   0.00   0.00   NaN
5       Facebook Цена акций Facebook  193.53   0.00   0.00   NaN
6          Tesla Цены на акции Тесла  357.89   0.00   0.00   NaN
7          Twiter Цена акций твитера   30.38   0.00   0.00   NaN
8  Hasbro Цена на акции Hasbro, Inc.  103.93  19.06  22.46   NaN

In [172]:
colors = pd.read_html('https://colorscheme.ru/html-colors.html', encoding='utf-8')[1].dropna()
colors[ colors['HEX'].str.contains('#') ].head()

  HTML Имя Цвета      HEX            RGB
1      IndianRed  #CD5C5C    205, 92, 92
2     LightCoral  #F08080  240, 128, 128
3         Salmon  #FA8072  250, 128, 114
4     DarkSalmon  #E9967A  233, 150, 122
5    LightSalmon  #FFA07A  255, 160, 122

# Задание 4

Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [3]:
transactions = pd.read_csv('transactions.csv')
transactions.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [22]:
transactions[(transactions['Product']=='_8')].sort_values(by=['Cost'], ascending=False).filter(items = ['ID']).head(1)

      ID
54  t055